using System.Collections;
using System.Collections.Generic;
using UnityEngine;

//*|***|***|***|***|***|***|***|***|***|***|***|
// プレイヤー倉庫言い換え
//*|***|***|***|***|***|***|***|***|***|***|***|
using WarehousePlayer = WarehouseData.PlayerData.WarehousePlayer;
//*|***|***|***|***|***|***|***|***|***|***|***|
// プレイヤー参照言い換え
//*|***|***|***|***|***|***|***|***|***|***|***|
//using WarehousePlayer = WarehouseData.PlayerData.WarehousePlayer;

abstract public class EnemyBodyParts : MonoBehaviour
{
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // プレイヤー参照
    //*|***|***|***|***|***|***|***|***|***|***|***|
    protected PlayerDirectorIndex m_playerIndex;
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // パーツデータ
    //*|***|***|***|***|***|***|***|***|***|***|***|
    protected Rigidbody2D m_rigid2D;
    protected string m_hitTag;
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // パーツデータ起動中
    //*|***|***|***|***|***|***|***|***|***|***|***|
    protected bool m_awakeFlag;
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // パーツデータ被弾
    //*|***|***|***|***|***|***|***|***|***|***|***|
    protected bool m_hitAttack;
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // これが出来たときに
    //*|***|***|***|***|***|***|***|***|***|***|***|
    void Awake()
    {
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // プレイヤー参照
        //*|***|***|***|***|***|***|***|***|***|***|***|
        m_playerIndex = PlayerDirectorIndex.GetInstance();
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // 自身を改造
        //*|***|***|***|***|***|***|***|***|***|***|***|
        gameObject.layer = WarehousePlayer.GetLayer_EnemyBodyParts();
        gameObject.tag = WarehousePlayer.GetTag_EnemyAttackParts();
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // ボディデータ
        //*|***|***|***|***|***|***|***|***|***|***|***|
        this.m_rigid2D = gameObject.AddComponent<Rigidbody2D>();
        this.m_rigid2D.sleepMode = RigidbodySleepMode2D.NeverSleep;
        this.m_rigid2D.isKinematic = true;
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // パーツデータ起動中 停止中
        //*|***|***|***|***|***|***|***|***|***|***|***|
        m_awakeFlag = false;
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // パーツデータ攻撃力
        //*|***|***|***|***|***|***|***|***|***|***|***|
        m_hitAttack = false;
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // これが出来たときに続きは個別で
        //*|***|***|***|***|***|***|***|***|***|***|***|
        AwakeCollider();
    }
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // これが出来たときに続きは個別で
    //*|***|***|***|***|***|***|***|***|***|***|***|
    protected abstract void AwakeCollider();
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // これが出来たときに
    //*|***|***|***|***|***|***|***|***|***|***|***|
    void Start()
    {
        this.m_rigid2D.isKinematic = true;
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // これが出来たときに続きは個別で
        //*|***|***|***|***|***|***|***|***|***|***|***|
        StartCollider();
    }
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // これが出来たときに続きは個別で
    //*|***|***|***|***|***|***|***|***|***|***|***|
    protected abstract void StartCollider();

    //*|***|***|***|***|***|***|***|***|***|***|***|
    // 当たり判定大きさ
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public abstract void SetPointSize(Vector2 point, Vector2 size);
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // 当たり判定停止
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public abstract void SetStopHit();
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // 当たり判定再生
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public abstract void SetPlayHit();
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // 当たり判定被弾
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public bool GetHitAttack()
    {
        return m_hitAttack;
    }

    //*|***|***|***|***|***|***|***|***|***|***|***|
    // 当たり判定取得
    //*|***|***|***|***|***|***|***|***|***|***|***|
    private void OnTriggerEnter2D(Collider2D col)
    {
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // ダメージ報告腕
        //*|***|***|***|***|***|***|***|***|***|***|***|
        if(col.tag == WarehousePlayer.GetTag_AttackBoal())
        {
            m_hitAttack = true;
        }
    }

}
