using System.Collections;
using System.Collections.Generic;
using UnityEngine;


public class PlaySceneDirectorRocketIndex
{
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // シングルトン
    //*|***|***|***|***|***|***|***|***|***|***|***|
    private static PlaySceneDirectorRocketIndex m_director = null;
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // シングルトン生成
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public static PlaySceneDirectorRocketIndex GetInstance()
    {
        if (m_director == null)
        {
            m_director = new PlaySceneDirectorRocketIndex();
        }
        return m_director;
    }
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // シングルトン消滅
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public static void Remove()
    {
        if (m_director != null)
        {
            m_director = null;
        }
    }
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // データ
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // メインカメラ
    //*|***|***|***|***|***|***|***|***|***|***|***|
    Camera m_mainCamera;
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // メインカメラにターゲットされている
    //*|***|***|***|***|***|***|***|***|***|***|***|
    TargetFollow m_targetCamera;
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // カメラ子のシェイク取得
    //*|***|***|***|***|***|***|***|***|***|***|***|
    ShakeCamera m_shakeCamera;
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // フェードアウト
    //*|***|***|***|***|***|***|***|***|***|***|***|
    StartFade m_fadeOut;
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // プレイシーンのBGM係
    //*|***|***|***|***|***|***|***|***|***|***|***|
    GameObject m_BGMObject;
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // データ初期化
    //*|***|***|***|***|***|***|***|***|***|***|***|
    PlaySceneDirectorRocketIndex()
    {
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // メインカメラ
        //*|***|***|***|***|***|***|***|***|***|***|***|
        m_mainCamera = null;
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // メインカメラにターゲットされている
        //*|***|***|***|***|***|***|***|***|***|***|***|
        m_targetCamera = null;
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // カメラ子のシェイク取得
        //*|***|***|***|***|***|***|***|***|***|***|***|
        m_shakeCamera = null;
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // フェードアウト
        //*|***|***|***|***|***|***|***|***|***|***|***|
        m_fadeOut = null;
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // プレイシーンのBGM係
        //*|***|***|***|***|***|***|***|***|***|***|***|
        m_BGMObject = null;
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // ゲームクリア！
        //*|***|***|***|***|***|***|***|***|***|***|***|
        SetAliveFlagPlayScene(false);
    }
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // データ終了
    //*|***|***|***|***|***|***|***|***|***|***|***|
    ~PlaySceneDirectorRocketIndex()
    {
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // メインカメラ
        //*|***|***|***|***|***|***|***|***|***|***|***|
        m_mainCamera = null;
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // メインカメラにターゲットされている
        //*|***|***|***|***|***|***|***|***|***|***|***|
        m_targetCamera = null;
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // カメラ子のシェイク取得
        //*|***|***|***|***|***|***|***|***|***|***|***|
        m_shakeCamera = null;
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // フェードアウト
        //*|***|***|***|***|***|***|***|***|***|***|***|
        m_fadeOut = null;
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // プレイシーンのBGM係
        //*|***|***|***|***|***|***|***|***|***|***|***|
        m_BGMObject = null;
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // ゲームクリア！
        //*|***|***|***|***|***|***|***|***|***|***|***|
        SetAliveFlagPlayScene(false);
    }
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // データ終わりか？再生か？
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public void AllReset()
    {
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // メインカメラ
        //*|***|***|***|***|***|***|***|***|***|***|***|
        m_mainCamera = null;
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // メインカメラにターゲットされている
        //*|***|***|***|***|***|***|***|***|***|***|***|
        m_targetCamera = null;
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // カメラ子のシェイク取得
        //*|***|***|***|***|***|***|***|***|***|***|***|
        m_shakeCamera = null;
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // フェードアウト
        //*|***|***|***|***|***|***|***|***|***|***|***|
        m_fadeOut = null;
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // プレイシーンのBGM係
        //*|***|***|***|***|***|***|***|***|***|***|***|
        m_BGMObject = null;
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // ゲームクリア！
        //*|***|***|***|***|***|***|***|***|***|***|***|
        SetAliveFlagPlayScene(false);
    }
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // 更新処理
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public void Update()
    {

    }
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // ポインター受付
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public void SetPointerMainCamera(Camera camera)
    {
        m_mainCamera = camera;
    }
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // ポインター受付
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public void SetPointerTargetCamera(TargetFollow follow)
    {
        m_targetCamera = follow;
    } 
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // ポインター受付
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public void SetPointerShakeCamera(ShakeCamera shake)
    {
        m_shakeCamera = shake;
    }
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // ポインター受付
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public void SetPointerFadeData(StartFade fade)
    {
        m_fadeOut = fade;
    }
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // ポインター受付
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public void SetPointerBGMObjectData(GameObject bgm)
    {
        m_BGMObject = bgm;
    }
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // ポインター取得
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public Camera GetPointerMainCamera()
    {
        return m_mainCamera;
    }
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // ポインター取得
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public TargetFollow GetPointerTargetCamera()
    {
        return m_targetCamera;
    }
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // ポインター取得
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public ShakeCamera GetPointerShakeCamera()
    {
        return m_shakeCamera;
    }
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // フェードアウトを指示
    // 後からの指示に従う。
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public void StartFadeOut(float speed)
    {
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // ポインターチェック
        //*|***|***|***|***|***|***|***|***|***|***|***|
        if (m_fadeOut)
        {
            m_fadeOut.SetFadeSpeed(speed);
            m_fadeOut.SetFadeOutFlag(true);
        }
    }
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // フェードインを指示
    // 後からの指示に従う。
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public void StartFadeIn(float speed)
    {
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // ポインターチェック
        //*|***|***|***|***|***|***|***|***|***|***|***|
        if (m_fadeOut)
        {
            m_fadeOut.SetFadeSpeed(speed);
            m_fadeOut.SetFadeInFlag(true);
        }
    }
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // フェードインを指示
    // 後からの指示に従う。
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public bool GetFadeWork()
    {    
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // ポインターチェック
        //*|***|***|***|***|***|***|***|***|***|***|***|
        if (m_fadeOut)
        {
            return m_fadeOut.GetFadeWarkFlag();
        }
        return false;
    }
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // フェードインを指示
    // 後からの指示に従う。
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public void SetFadeAlpha(float alpha)
    {
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // ポインターチェック
        //*|***|***|***|***|***|***|***|***|***|***|***|
        if (m_fadeOut)
        {
            m_fadeOut.SetAlphaValue(alpha);
        }
    }
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // 音楽流す？
    //*|***|***|***|***|***|***|***|***|***|***|***|
    public void SetBGMFlow(bool flag)
    {
        //*|***|***|***|***|***|***|***|***|***|***|***|
        // ポインターチェック
        //*|***|***|***|***|***|***|***|***|***|***|***|
        if (m_BGMObject)
        {
            m_BGMObject.SetActive(flag);
        }
    }
    //*|***|***|***|***|***|***|***|***|***|***|***|
    // ゲームクリア！
    //*|***|***|***|***|***|***|***|***|***|***|***|
    bool m_aliveFlagPlayScene;
    public void SetAliveFlagPlayScene(bool setBool)
    {
        m_aliveFlagPlayScene = setBool;
    }
    public bool GetAliveFlagPlayScene()
    {
        return m_aliveFlagPlayScene;
    }
}
